### 예제
1.csv 폴더에 있는 파일 4개 로드 ( tran_1, tran_2,tran_d_1 ,tran_d_2 )
2. tran_1, tran_2 단순하게 행을 추가 결합 ( tran )
3. tran_d_1 ,tran_2 단순하게 행을 추가 결합 ( tran_d)
4. 2번,3번 과정에서 결합한 데이터프레임을 특정 조건에 맞춰서 left(tran) 를 기준으로 열 결합 ( transaction)

In [66]:
import pandas as pd

In [67]:
tran1 = pd.read_csv ('../CSV/tran_1.csv')
tran2 = pd.read_csv ('../CSV/tran_2.csv')
tran_d1 = pd.read_csv ('../CSV/tran_d_1.csv')
tran_d2 = pd. read_csv ('../CSV/tran_d_2.csv')
tran = pd.concat ([tran1,tran2], axis = 0, ignore_index= True)
tran_d = pd.concat ( [tran_d1,tran_d2], axis = 0, ignore_index= True)
transaction = pd.merge (tran, tran_d ,on ='transaction_id', how = 'left')
transaction

,transaction_id,price,payment_date,customer_id,detail_id,item_id,quantity
0,T0000000113,210000,2019-02-01 01:36:57,PL563502,0,S005,1
1,T0000000114,50000,2019-02-01 01:37:23,HD678019,1,S001,1
2,T0000000115,120000,2019-02-01 02:34:19,HD298120,2,S003,1
3,T0000000116,210000,2019-02-01 02:47:23,IK452215,3,S005,1
4,T0000000117,170000,2019-02-01 04:33:46,PL542865,4,S002,2
...,...,...,...,...,...,...,...
7139,T0000006894,180000,2019-07-31 21:20:44,HI400734,7139,S004,1
7140,T0000006895,85000,2019-07-31 21:52:48,AS339451,7140,S002,1
7141,T0000006896,100000,2019-07-31 23:35:25,OA027325,7141,S001,2
7142,T0000006897,85000,2019-07-31 23:39:35,TS624738,7142,S002,1
7143,T0000006898,85000,2019-07-31 23:41:38,AS834214,7143,S002,1

In [68]:
tran = pd.concat ([tran1,tran2], axis = 0, ignore_index= True)
tran.head(2)

  transaction_id   price         payment_date customer_id
0    T0000000113  210000  2019-02-01 01:36:57    PL563502
1    T0000000114   50000  2019-02-01 01:37:23    HD678019

In [69]:
tran_d = pd.concat ( [tran_d1,tran_d2], axis = 0, ignore_index= True)
tran_d.head(2)

   detail_id transaction_id item_id  quantity
0          0    T0000000113    S005         1
1          1    T0000000114    S001         1

In [70]:
## 특정 조건에 맞춰서 tran 을 기준으로 열을 추가 결합 
## 특정 조건(transaction_id : 두가지 dataframe 의공통적인 조건 )
## how (left = tran)
transaction = pd.merge (tran, tran_d ,on ='transaction_id', how = 'left')
transaction

,transaction_id,price,payment_date,customer_id,detail_id,item_id,quantity
0,T0000000113,210000,2019-02-01 01:36:57,PL563502,0,S005,1
1,T0000000114,50000,2019-02-01 01:37:23,HD678019,1,S001,1
2,T0000000115,120000,2019-02-01 02:34:19,HD298120,2,S003,1
3,T0000000116,210000,2019-02-01 02:47:23,IK452215,3,S005,1
4,T0000000117,170000,2019-02-01 04:33:46,PL542865,4,S002,2
...,...,...,...,...,...,...,...
7139,T0000006894,180000,2019-07-31 21:20:44,HI400734,7139,S004,1
7140,T0000006895,85000,2019-07-31 21:52:48,AS339451,7140,S002,1
7141,T0000006896,100000,2019-07-31 23:35:25,OA027325,7141,S001,2
7142,T0000006897,85000,2019-07-31 23:39:35,TS624738,7142,S002,1
7143,T0000006898,85000,2019-07-31 23:41:38,AS834214,7143,S002,1

### 데이터 결합2 
1. 파일로드 ( customer_master, item_master)
2. 1번 과정에서 불러온 2개의 데이터프레임을 transaction 의 조건에 맞게 조인 결합. 
3. 결합이 된 데이터프레임에서 quantity 컬럼과 item_price 컬럼을 가지고 total_price 새로운 컬럼을 추가 ( quantity x itme_price)
4. payment_data 컬럼을 시계열 데이터로 변경

In [71]:
cm = pd.read_csv('../CSV/customer_master.csv')
im = pd.read_csv('../CSV/item_master.csv')

In [72]:
cm.head(1)

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0

In [73]:
im.head(1)

  item_id item_name  item_price
0    S001      PC-A       50000

In [74]:
## transaction 과 CM 데이터프레임을 특정 조건으로 결합
## 공통 조건은 'customer_id ' 이다. 
join_data = pd.merge ( transaction , cm , on = 'customer_id', how ='left')
## customer_id 가 공통적인 column 에 해당
join_data.head(1)

,transaction_id,price,payment_date,customer_id,detail_id,item_id,quantity,name,class,gender,start_date,end_date,campaign_id,is_deleted
0,T0000000113,210000,2019-02-01 01:36:57,PL563502,0,S005,1,XX,C01,M,2018-07-01 00:00:00,NaN,CA1,0.0

In [75]:
total_df = pd.merge (join_data , im ,on = 'item_id', how ='left')
total_df.head(1)

,transaction_id,price,payment_date,customer_id,detail_id,item_id,quantity,name,class,gender,start_date,end_date,campaign_id,is_deleted,item_name,item_price
0,T0000000113,210000,2019-02-01 01:36:57,PL563502,0,S005,1,XX,C01,M,2018-07-01 00:00:00,NaN,CA1,0.0,PC-E,210000

In [77]:
total_df ['Total price'] = total_df ['quantity'] * total_df['item_price']

In [78]:
total_df.head(1)

,transaction_id,price,payment_date,customer_id,detail_id,item_id,quantity,name,class,gender,start_date,end_date,campaign_id,is_deleted,item_name,item_price,Total price
0,T0000000113,210000,2019-02-01 01:36:57,PL563502,0,S005,1,XX,C01,M,2018-07-01 00:00:00,NaN,CA1,0.0,PC-E,210000,210000

In [82]:
### payment_date 를 시계형으로 변경 
pd.to_datetime(total_df['payment_date'], format ='%Y-%m-%d %H:%M:%S')
## 실수하는 부분 
## total_df = pd.to_datetime(total_df['payment_date'], format ='%Y-%m-%d %H:%M:%S') 
## 모든 total_df 값이 series 로 변경됨.

0      2019-02-01 01:36:57
1      2019-02-01 01:37:23
2      2019-02-01 02:34:19
3      2019-02-01 02:47:23
4      2019-02-01 04:33:46
               ...
7139   2019-07-31 21:20:44
7140   2019-07-31 21:52:48
7141   2019-07-31 23:35:25
7142   2019-07-31 23:39:35
7143   2019-07-31 23:41:38
Name: payment_date, Length: 7144, dtype: datetime64[ns]

In [84]:
total_df['payment_date'] = pd.to_datetime(total_df['payment_date'], format ='%Y-%m-%d %H:%M:%S') 
total_df.head(1)

,transaction_id,price,payment_date,customer_id,detail_id,item_id,quantity,name,class,gender,start_date,end_date,campaign_id,is_deleted,item_name,item_price,Total price
0,T0000000113,210000,2019-02-01 01:36:57,PL563502,0,S005,1,XX,C01,M,2018-07-01 00:00:00,NaN,CA1,0.0,PC-E,210000,210000